REGULAR/Bmesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.000000000e+00 -5.000000000e-01 -5.000000000e-02) 
    (6.000000000e-01 -5.000000000e-01 -5.000000000e-02) 
    (9.000000000e-01 -5.000000000e-01 -5.000000000e-02) 
    (2.000000000e+00 -5.000000000e-01 -5.000000000e-02) 
    (0.000000000e+00 0.000000000e+00 -5.000000000e-02) 
    (6.000000000e-01 0.000000000e+00 -5.000000000e-02) 
    (9.000000000e-01 -2.624659906e-02 -5.000000000e-02) 
    (2.000000000e+00 -2.624659906e-02 -5.000000000e-02) 
    (1.100000000e+00 -0.000000000e+00 -5.000000000e-02) 
    (2.000000000e+00 -0.000000000e+00 -5.000000000e-02) 
    (9.000000000e-01 2.624659906e-02 -5.000000000e-02) 
    (2.000000000e+00 2.624659906e-02 -5.000000000e-02) 
    (0.000000000e+00 5.000000000e-01 -5.000000000e-02) 
    (6.000000000e-01 5.000000000e-01 -5.000000000e-02) 
    (9.000000000e-01 5.000000000e-01 -5.000000000e-02) 
    (2.000000000e+00 5.000000000e-01 -5.000000000e-02) 
    (0.000000000e+00 -5.000000000e-01 5.000000000e-02) 
    (6.000000000e-01 -5.000000000e-01 5.000000000e-02) 
    (9.000000000e-01 -5.000000000e-01 5.000000000e-02) 
    (2.000000000e+00 -5.000000000e-01 5.000000000e-02) 
    (0.000000000e+00 0.000000000e+00 5.000000000e-02) 
    (6.000000000e-01 0.000000000e+00 5.000000000e-02) 
    (9.000000000e-01 -2.624659906e-02 5.000000000e-02) 
    (2.000000000e+00 -2.624659906e-02 5.000000000e-02) 
    (1.100000000e+00 -0.000000000e+00 5.000000000e-02) 
    (2.000000000e+00 -0.000000000e+00 5.000000000e-02) 
    (9.000000000e-01 2.624659906e-02 5.000000000e-02) 
    (2.000000000e+00 2.624659906e-02 5.000000000e-02) 
    (0.000000000e+00 5.000000000e-01 5.000000000e-02) 
    (6.000000000e-01 5.000000000e-01 5.000000000e-02) 
    (9.000000000e-01 5.000000000e-01 5.000000000e-02) 
    (2.000000000e+00 5.000000000e-01 5.000000000e-02) 
);

blocks
( 
    hex (0 1 5 4 16 17 21 20) (10 10 1) simpleGrading (1.0 1.0 1.0) 
    hex (1 2 6 5 17 18 22 21) (10 10 1) simpleGrading (1.0 1.0 1.0) 
    hex (2 3 7 6 18 19 23 22) (10 10 1) simpleGrading (1.0 1.0 1.0) 
    hex (6 7 9 8 22 23 25 24) (10 10 1) simpleGrading (1.0 1.0 1.0) //3
    hex (8 9 11 10 24 25 27 26) (10 10 1) simpleGrading (1.0 1.0 1.0) //4
    hex (10 11 15 14 26 27 31 30) (10 10 1) simpleGrading (1.0 1.0 1.0) 
    hex (5 10 14 13 21 26 30 29) (10 10 1) simpleGrading (1.0 1.0 1.0) 
    hex (4 5 13 12 20 21 29 28) (10 10 1) simpleGrading (1.0 1.0 1.0) 
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (12 28 20 4) 
            (4 20 16 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (15 31 27 11) 
            (11 27 25 9) 
            (9 25 23 7) 
            (7 23 19 3)
        );
    }
    bottom
    {
        type slip;
        faces
        (
            (0 16 17 1) 
            (1 17 18 2) 
            (2 18 19 3)
        );
    }
    top
    {
        type slip;
        faces
        (
            (12 28 29 13) 
            (13 29 30 14) 
            (14 30 31 15)
        );
    }
    obstacle
    {
        type wall;
        faces
        (
            (5 21 26 10) 
            (10 26 24 8) 
            (8 24 22 6) 
            (6 22 21 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
