REGULAR/Bmesh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       1520;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       1540;
    }
    bottom
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          30;
        startFace       1580;
    }
    top
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          30;
        startFace       1610;
    }
    obstacle
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       1640;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          1600;
        startFace       1680;
    }
)

// ************************************************************************* //
